---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooLargeSketch
source: html/e4b7ae47-1123-19b0-a857-6d70fd995761.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooLargeSketch Property

Sketch of <element> has large area - it may slow down selection, drawing and geometric computations.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooLargeSketch { get; }
```